Tekla Open API Reference for Tekla Structures 2025
Assembly.CompareTo Method
Overload List
Name | Description
CompareTo(Object)
 Compares Identifiers of model objects.
 (Inherited from ModelObject.)
CompareTo(Assembly)
 Compares the instantiated assembly with another one.
Top
See Also
Reference
Assembly Class
Tekla.Structures.Model Namespace